import { FaRegCopy } from "react-icons/fa6";

export const servicesData = [
  {
    "image": "https://i.ibb.co/WNT8ZbTD/diabetes.png",
    "title": "ডায়াবেটিস (সুগার)",
    "description": "ডায়াবেটিস, বাংলায় যা সুগার নামেও পরিচিত, এটি একটি ক্রনিক (দীর্ঘমেয়াদি) স্বাস্থ্য সমস্যা যেখানে শরীরের রক্তে গ্লুকোজের পরিমাণ স্বাভাবিকের চেয়ে বেড়ে যায়। এটি মূলত ইনসুলিন নামক হরমোনের অভাব বা কার্যকারিতার অভাবে ঘটে। ডায়াবেটিসের প্রধানত তিনটি ধরন রয়েছে: 1. *টাইপ ১ ডায়াবেটিস:* এই ধরনের ডায়াবেটিসে শরীর পর্যাপ্ত ইনসুলিন উৎপাদন করতে পারে না কারণ ইমিউন সিস্টেম ইনসুলিন উৎপাদনকারী কোষগুলোকে ধ্বংস করে দেয়। এটি সাধারণত শিশু বা তরুণদের মধ্যে দেখা যায়। 2. *টাইপ ২ ডায়াবেটিস:* এটি সবচেয়ে সাধারণ ধরনের ডায়াবেটিস এবং সাধারণত প্রাপ্তবয়স্কদের মধ্যে দেখা যায়। এখানে শরীর পর্যাপ্ত ইনসুলিন উৎপাদন করতে পারলেও উৎপাদিত ইনসুলিন কার্যকরভাবে ব্যবহার করতে পারে না। 3. *গর্ভকালীন ডায়াবেটিস:* এটি গর্ভাবস্থায় ঘটে এবং সাধারণত জন্মের পর ঠিক হয়ে যায়। তবে, এটি ভবিষ্যতে টাইপ ২ ডায়াবেটিসের ঝুঁকি বাড়াতে পারে। ডায়াবেটিসের উপসর্গগুলির মধ্যে রয়েছে: - অতিরিক্ত তৃষ্ণা - ঘন ঘন প্রস্রাব - অতিরিক্ত ক্ষুধা - ক্লান্তি - ওজন হ্রাস (টাইপ ১ ডায়াবেটিসে)"
  },
  {
    "image": "https://i.ibb.co/VW9WWSvv/pressure.png",
    "title": "হাই প্রেসার (উচ্চ রক্তচাপ)",
    "description": "ফ্যাটি কিডনি, বা রেনাল লিপোমাটোসিস, হলো একটি অবস্থা যেখানে কিডনির চারপাশে অত্যধিক ফ্যাট জমা হয়। সাধারণত কিডনি এবং এর চারপাশের ফ্যাট টিস্যুর মধ্যে ভারসাম্য থাকে, যা কিডনিকে সুরক্ষা দেয়। কিন্তু যখন এই ফ্যাট অস্বাভাবিকভাবে বেড়ে যায়, তখন কিডনির কার্যক্ষমতা প্রভাবিত হতে পারে। ফ্যাটি কিডনির কারণ: স্থূলতা (ওবেসিটি) কিডনির দীর্ঘমেয়াদি রোগ হরমোনজনিত সমস্যাগুলো (যেমন কুশিং'স সিনড্রোম) দীর্ঘমেয়াদি ডায়াবেটিস বা উচ্চ রক্তচাপ উপসর্গ: সাধারণত কোন স্পষ্ট উপসর্গ দেখা যায় না। তবে যখন ফ্যাট অতিরিক্ত পরিমাণে জমা হয়, তখন কিডনির কার্যক্ষমতা হ্রাস পেতে পারে। মূত্রত্যাগে সমস্যা, পিঠে বা কোমরে ব্যথা হতে পারে।"
  },
  {
    "image": "https://i.ibb.co/XrZS7N62/ojon.png",
    "title": "অতিরিক্ত ওজন (স্থুলতা)",
    "description": "অতিরিক্ত ওজন বা স্থূলতা হলো এমন একটি অবস্থা যেখানে শরীরে অতিরিক্ত ফ্যাট জমা হয়, যা স্বাস্থ্য সমস্যা তৈরি করতে পারে। স্থূলতা হৃদরোগ, ডায়াবেটিস, উচ্চ রক্তচাপ, এবং কিছু ধরনের ক্যান্সারের ঝুঁকি বাড়ায়। স্থূলতার কারণগুলো: 1. *অপুষ্টিকর খাদ্যাভ্যাস*: বেশি পরিমাণে ক্যালোরি গ্রহণ এবং কম পুষ্টিকর খাবার খাওয়া। 2. *অপর্যাপ্ত শারীরিক কার্যকলাপ*: নিয়মিত ব্যায়াম না করা। 3. *জেনেটিক কারণ*: বংশগত কারণে স্থূলতার প্রবণতা থাকতে পারে। 4. *মানসিক চাপ ও আবেগ*: মানসিক চাপ এবং আবেগজনিত কারণে অতিরিক্ত খাওয়া। 5. *হরমোনগত সমস্যা*: কিছু হরমোনজনিত সমস্যা যেমন থাইরয়েডের সমস্যা স্থূলতা সৃষ্টি করতে পারে। 6. *ঔষধের পার্শ্বপ্রতিক্রিয়া*: কিছু ঔষধ স্থূলতার কারণ হতে পারে।"
  },

  {
    "image": "https://i.ibb.co/PZ7WCB8X/kidney.png",
    "title": "কিডনিতে পাথর (কিডনি স্টোন)",
    "description": "কিডনিতে পাথর বা কিডনি স্টোন হলো কঠিন খনিজ ও লবণের স্ফটিক যা কিডনিতে জমে যায়। এটি খুবই ব্যথাদায়ক হতে পারে এবং প্রায়ই প্রস্রাবের সময় সমস্যা সৃষ্টি করে। কিডনি স্টোনের কারণসমূহ: 1. *অপর্যাপ্ত পানি পান*: শরীরে পর্যাপ্ত পানি না থাকলে মূত্র ঘন হয়ে যায় এবং খনিজ ও লবণ জমা হয়ে পাথর তৈরি হতে পারে। 2. *খাদ্যাভ্যাস*: বেশি পরিমাণে লবণ, প্রোটিন, এবং অক্সালেট সমৃদ্ধ খাবার খাওয়া। 3. *পারিবারিক ইতিহাস*: বংশগত কারণে কিডনি স্টোনের ঝুঁকি বাড়ে। 4. *স্থূলতা*: ওজন বেশি থাকলে কিডনি স্টোনের ঝুঁকি বাড়ে। 5. *কিছু চিকিৎসা*: কিছু ঔষধ এবং চিকিৎসা পদ্ধতি কিডনি স্টোনের ঝুঁকি বাড়াতে পারে। কিডনি স্টোনের লক্ষণসমূহ: 1. তীব্র পিঠ বা পেটের ব্যথা 2. প্রস্রাবে রক্ত বা প্রস্রাবের রং গোলাপি, লাল বা বাদামী হওয়া 3. প্রস্রাবে জ্বালা বা ব্যথা 4. ঘন ঘন প্রস্রাবের প্রয়োজন বোধ করা 5. বমি বমি ভাব এবং বমি"
  },
  {
    "image": "https://i.ibb.co/7dq9sgKd/fattie-Kidney.png",
    "title": "ফ্যাটি কিডনি",
    "description": "ফ্যাটি কিডনি, বা রেনাল লিপোমাটোসিস, হলো একটি অবস্থা যেখানে কিডনির চারপাশে অত্যধিক ফ্যাট জমা হয়। সাধারণত কিডনি এবং এর চারপাশের ফ্যাট টিস্যুর মধ্যে ভারসাম্য থাকে, যা কিডনিকে সুরক্ষা দেয়। কিন্তু যখন এই ফ্যাট অস্বাভাবিকভাবে বেড়ে যায়, তখন কিডনির কার্যক্ষমতা প্রভাবিত হতে পারে। ফ্যাটি কিডনির কারণ: স্থূলতা (ওবেসিটি) কিডনির দীর্ঘমেয়াদি রোগ হরমোনজনিত সমস্যাগুলো (যেমন কুশিং'স সিনড্রোম) দীর্ঘমেয়াদি ডায়াবেটিস বা উচ্চ রক্তচাপ উপসর্গ: সাধারণত কোন স্পষ্ট উপসর্গ দেখা যায় না। তবে যখন ফ্যাট অতিরিক্ত পরিমাণে জমা হয়, তখন কিডনির কার্যক্ষমতা হ্রাস পেতে পারে। মূত্রত্যাগে সমস্যা, পিঠে বা কোমরে ব্যথা হতে পারে।"
  },
  {
    "image": "https://i.ibb.co/Xx0Gs0Fr/heart-Block.png",
    "title": "হার্ট ব্লকেজ",
    "description": "হার্ট ব্লকেজ (Heart blockage) মূলত হৃদপিণ্ডের ধমনীতে ব্লকেজ বা বাধার সৃষ্টি হওয়া বোঝায়। এই ধমনীগুলি হল হৃদপিণ্ডের রক্ত সরবরাহের প্রধান রাস্তা, এবং যখন এই রাস্তাগুলি ব্লক হয়, তখন হৃদপিণ্ড প্রয়োজনীয় অক্সিজেন ও পুষ্টি পায় না।হার্ট ব্লকেজের কয়েকটি প্রধান কারণ হতে পারে:অ্যাথেরোস্ক্লেরোসিস: ধমনীগুলির মধ্যে কোলেস্টেরল ও ফ্যাট জমে যাওয়ার ফলে ব্লকেজ সৃষ্টি হতে পারে।ক্যালসিফিকেশন: ধমনীগুলিতে ক্যালসিয়াম জমে যায়।থ্রম্বোসিস: রক্ত জমাট বাঁধার ফলে ধমনীর ব্লকেজ হয়।ধমনীর পেশীর অত্যধিক বৃদ্ধির ফলে: ধমনীর ভেতরের পেশীর দেয়াল মোটা হয়ে যায়, যার ফলে ব্লকেজ হয়।হার্ট ব্লকেজের লক্ষণগুলি হতে পারে:বুকে ব্যথা (অ্যাঞ্জাইনা)শ্বাসকষ্টদ্রুত ক্লান্তিঅস্বাভাবিক হৃদস্পন্দনহাত, পা বা চোয়ালে ব্যথা"
  },

  {
    "image": "https://i.ibb.co/zhLK9bPy/tg.png",
    "title": "ট্রাইগ্লিসারাইড (টিজি)",
    "description": "ট্রাইগ্লিসারাইড (টিজি) হল এক ধরণের ফ্যাট বা লিপিড, যা আমাদের শরীরে শক্তি সঞ্চিত রাখে। আমাদের শরীর খাদ্য থেকে গ্রহণকৃত অতিরিক্ত ক্যালোরি ট্রাইগ্লিসারাইডে রূপান্তরিত করে এবং ফ্যাট কোষে সঞ্চিত রাখে। যখন আমাদের শরীরকে শক্তির প্রয়োজন হয় এবং তা খাদ্য থেকে পাওয়া যায় না, তখন এই সঞ্চিত ট্রাইগ্লিসারাইড ব্যবহৃত হয়।ট্রাইগ্লিসারাইডের উচ্চমাত্রা স্বাস্থ্যজনিত সমস্যা সৃষ্টি করতে পারে, যেমন হৃদরোগ ও স্ট্রোকের ঝুঁকি বৃদ্ধি করতে পারে। তাই ট্রাইগ্লিসারাইডের মাত্রা নিয়ন্ত্রণে রাখা গুরুত্বপূর্ণ।"
  },
  {
    "image": "https://i.ibb.co/nq93vCk7/liver.png",
    "title": "লিভারে চর্বি জমা (ফ্যাটি লিভার)",
    "description": "লিভারে চর্বি জমা বা ফ্যাটি লিভার হলো এমন একটি অবস্থা যেখানে লিভার কোষে অতিরিক্ত চর্বি জমা হয়। এটি সাধারণত নিরীহ হলেও গুরুতর ক্ষেত্রে লিভারের প্রদাহ ও ক্ষতি হতে পারে। ফ্যাটি লিভার প্রধানত দুই ধরনের হতে পারে: অ্যালকোহলিক ফ্যাটি লিভার ডিজিজ (AFLD) এবং নন-অ্যালকোহলিক ফ্যাটি লিভার ডিজিজ (NAFLD)। ফ্যাটি লিভারের কারণসমূহ: 1. *অতিরিক্ত অ্যালকোহল গ্রহণ*: অ্যালকোহলিক ফ্যাটি লিভারের প্রধান কারণ। 2. *অতিরিক্ত ওজন বা স্থূলতা*: নন-অ্যালকোহলিক ফ্যাটি লিভারের প্রধান কারণ। 3. *ডায়াবেটিস*: টাইপ ২ ডায়াবেটিসে আক্রান্ত ব্যক্তিদের ফ্যাটি লিভারের ঝুঁকি বেশি। 4. *উচ্চ কোলেস্টেরল*: উচ্চ রক্তের কোলেস্টেরল এবং ট্রাইগ্লিসারাইড স্তর। 5. *অপুষ্টিকর খাদ্যাভ্যাস*: উচ্চ চর্বি ও শর্করা যুক্ত খাবার। 6. *হেপাটাইটিস*: কিছু ধরনের হেপাটাইটিস ভাইরাস। ফ্যাটি লিভারের লক্ষণসমূহ: 1. *অসুস্থতা বা ক্লান্তি*: দীর্ঘমেয়াদি ক্লান্তি এবং দুর্বলতা। 2. *ডান দিকের পেটের উপরিভাগে ব্যথা*: লিভার বড় হয়ে গেলে এ ব্যথা অনুভূত হতে পারে। 3. *ওজন কমে যাওয়া*: অনিয়মিত ওজন হ্রাস। 4. *লিভারের প্রদাহ*: প্রদাহের ফলে লিভার ক্ষতিগ্রস্ত হতে পারে। 5. *বমি বমি ভাব ও খাওয়ায় অনীহা*।"
  },
  {
    "image": "https://i.ibb.co/RVXfkdz/bloodFat.png",
    "title": "কোলেস্ট্রল (রক্তে চর্বি)",
    "description": "কোলেস্টেরল হলো একটি চর্বিজাতীয় পদার্থ যা শরীরের প্রতিটি কোষে পাওয়া যায়। এটি শরীরের জন্য গুরুত্বপূর্ণ ভূমিকা পালন করে, যেমন হরমোন এবং ভিটামিন ডি তৈরি করতে সাহায্য করে। তবে, রক্তে অতিরিক্ত কোলেস্টেরল হৃদরোগ এবং স্ট্রোকের ঝুঁকি বাড়াতে পারে। কোলেস্টেরলের ধরনসমূহ: 1. *লো-ডেনসিটি লাইপোপ্রোটিন (LDL)*: 'খারাপ' কোলেস্টেরল হিসাবে পরিচিত, এটি ধমনীতে জমা হয়ে ব্লকেজ সৃষ্টি করতে পারে। 2. *হাই-ডেনসিটি লাইপোপ্রোটিন (HDL)*: 'ভাল' কোলেস্টেরল হিসাবে পরিচিত, এটি অতিরিক্ত কোলেস্টেরল ধমনীগুলো থেকে লিভারে নিয়ে যায়। 3. *ট্রাইগ্লিসারাইড*: আরেকটি চর্বিজাতীয় পদার্থ যা রক্তে পাওয়া যায় এবং উচ্চমাত্রায় থাকলে হৃদরোগের ঝুঁকি বাড়ায়। উচ্চ কোলেস্টেরলের কারণসমূহ: 1. *অপুষ্টিকর খাদ্যাভ্যাস*: বেশি স্যাচুরেটেড ফ্যাট এবং ট্রান্স ফ্যাটযুক্ত খাবার খাওয়া। 2. *অপর্যাপ্ত শারীরিক কার্যকলাপ*: নিয়মিত ব্যায়াম না করা। 3. *অতিরিক্ত ওজন বা স্থূলতা*: অতিরিক্ত ওজন রক্তে কোলেস্টেরলের মাত্রা বাড়ায়। 4. *ধূমপান*: ধূমপান HDL কোলেস্টেরলের মাত্রা কমিয়ে দেয়। 5. *বংশগত কারণ*: বংশগতভাবে উচ্চ কোলেস্টেরলের ঝুঁকি থাকতে পারে। উচ্চ কোলেস্টেরলের লক্ষণসমূহ: উচ্চ কোলেস্টেরল সাধারণত কোনো স্পষ্ট লক্ষণ তৈরি করে না, তবে এটি হৃদরোগ এবং স্ট্রোকের ঝুঁকি বাড়াতে পারে।"
  },
  {
    "image": "https://i.ibb.co/pv65pTs6/hyper.png",
    "title": "হাইপারইনসুলিনমিয়া",
    "description": "হাইপারইনসুলিনমিয়া হলো একটি অবস্থা যেখানে রক্তে স্বাভাবিকের চেয়ে বেশি ইনসুলিন থাকে। এটি সাধারণত ইনসুলিন রেজিস্ট্যান্স বা টাইপ ২ ডায়াবেটিসের প্রাথমিক লক্ষণ হিসাবে দেখা যায়। এই অবস্থা শরীরে বিভিন্ন সমস্যা সৃষ্টি করতে পারে। ### হাইপারইনসুলিনমিয়ার কারণসমূহ: 1. *ইনসুলিন রেজিস্ট্যান্স*: শরীরের কোষ ইনসুলিনের প্রতি সাড়া দেয় না, ফলে বেশি ইনসুলিন তৈরি হয়। 2. *অতিরিক্ত ওজন বা স্থূলতা*: শরীরে অতিরিক্ত ফ্যাট ইনসুলিন রেজিস্ট্যান্স সৃষ্টি করতে পারে। 3. *পলিসিস্টিক ওভারি সিনড্রোম (PCOS)*: মহিলাদের মধ্যে ইনসুলিন রেজিস্ট্যান্সের একটি সাধারণ কারণ। 4. *টাইপ ২ ডায়াবেটিস*: রক্তে উচ্চ শর্করার মাত্রা ইনসুলিনের মাত্রা বাড়াতে পারে। 5. *জেনেটিক কারণ*: বংশগত কারণে হাইপারইনসুলিনমিয়া হতে পারে। ### হাইপারইনসুলিনমিয়ার লক্ষণসমূহ: 1. *ওজন বাড়া*: বিশেষ করে পেটের চারপাশে। 2. *ক্রমাগত ক্ষুধা*: বিশেষ করে কার্বোহাইড্রেটযুক্ত খাবারের প্রতি। 3. *অতিরিক্ত ক্লান্তি*: দৈনিক কাজকর্মে অবসাদ এবং ক্লান্তি। 4. *ব্লাড সুগারের উঠানামা*: রক্তে শর্করার মাত্রা কমে যাওয়া বা বেড়ে যাওয়া। 5. *ব্লাড প্রেশার বেড়ে যাওয়া*: উচ্চ রক্তচাপের সমস্যা।"
  },
  {
    "image": "https://i.ibb.co/GfSs34hZ/pancreas.png",
    "title": "ফ্যাটি প্যানক্রিয়াস",
    "description": "ফ্যাটি প্যানক্রিয়াস (Fatty Pancreas) বা প্যানক্রিয়াটিক স্টিটোসিস এমন একটি অবস্থা যেখানে প্যানক্রিয়াসে অস্বাভাবিক পরিমাণে চর্বি জমা হয়। এটি সাধারণত মেটাবলিক সমস্যার সাথে সম্পর্কিত এবং ওজনাধিক্য বা স্থূলতার ফলে হতে পারে। প্যানক্রিয়াসের চর্বি জমে গেলে এর স্বাভাবিক কার্যক্রমে বিঘ্ন ঘটতে পারে এবং টাইপ ২ ডায়াবেটিস, ইনসুলিন রেসিস্ট্যান্স, বা প্যানক্রিয়াটাইটিসের মতো সমস্যার ঝুঁকি বাড়াতে পারে। ফ্যাটি প্যানক্রিয়াসের কারণ: 1. ওজনাধিক্য এবং স্থূলতা 2. মেটাবলিক সিন্ড্রোম 3. ইনসুলিন রেসিস্ট্যান্স বা টাইপ ২ ডায়াবেটিস 4. উচ্চ ফ্যাট সমৃদ্ধ খাদ্যাভ্যাস 5. অ্যালকোহলের অতিরিক্ত সেবন উপসর্গ: অনেক সময় ফ্যাটি প্যানক্রিয়াসের নির্দিষ্ট কোনো উপসর্গ থাকে না, তবে কিছু ক্ষেত্রে হতে পারে: পেটের ব্যথা হজমের সমস্যা ক্লান্তি বা দুর্বলতা"
  },
]

export const dashboardCardsData = [
  {
    "title": "Total Prescription",
    "value": "4.7k+",
    "icon": "📱",
    "bgColor": "bg-orange-100",
    "textColor": "text-orange-700"
  },
  {
    "title": "Total Patient",
    "value": "5.0k+",
    "icon": "👥",
    "bgColor": "bg-blue-100",
    "textColor": "text-blue-700"
  },
  {
    "title": "Low stock supplements",
    "value": "33+",
    "icon": "🅿️",
    "bgColor": "bg-red-100",
    "textColor": "text-red-700"
  },
  {
    "title": "Punch In",
    "value": "0",
    "icon": "📸",
    "bgColor": "bg-red-100",
    "textColor": "text-red-700"
  },
  {
    "title": "Punch Out",
    "value": "0",
    "icon": "📸",
    "bgColor": "bg-red-100",
    "textColor": "text-red-700"
  },
  {
    "title": "Appointment Pending",
    "value": "3+",
    "icon": "📝",
    "bgColor": "bg-pink-100",
    "textColor": "text-pink-700"
  },
  {
    "title": "Lab Report",
    "value": "703+",
    "icon": "🧪",
    "bgColor": "bg-red-100",
    "textColor": "text-red-700"
  },
  {
    "title": "Admin Activity",
    "value": "0+",
    "icon": "⚙️",
    "bgColor": "bg-yellow-100",
    "textColor": "text-yellow-700"
  },
  {
    "title": "Patient Due",
    "value": "369+",
    "icon": "💳",
    "bgColor": "bg-blue-100",
    "textColor": "text-blue-700"
  },
  {
    "title": "Diagnostic History",
    "value": "2.4k+",
    "icon": "🏥",
    "bgColor": "bg-green-100",
    "textColor": "text-green-700"
  },
  {
    "title": "Total Supplement",
    "value": "128+",
    "icon": "💊",
    "bgColor": "bg-teal-100",
    "textColor": "text-teal-700"
  },
  {
    "title": "Patient Supplement List",
    "value": "5.8k+",
    "icon": "📄",
    "bgColor": "bg-red-100",
    "textColor": "text-red-700"
  }
];


export const quickActions = [
  { id: "1", label: "Software Version", icon: <FaRegCopy className="text-2xl mx-auto" /> },
  { id: "2", label: "User Guide", icon: <FaRegCopy className="text-2xl mx-auto" /> },
  { id: "3", label: "Settings", icon: <FaRegCopy className="text-2xl mx-auto" /> },
  { id: "4", label: "Support", icon: <FaRegCopy className="text-2xl mx-auto" /> },
  { id: "5", label: "Feedback", icon: <FaRegCopy className="text-2xl mx-auto" /> },
  { id: "6", label: "Update", icon: <FaRegCopy className="text-2xl mx-auto" /> },
  { id: "7", label: "Backup", icon: <FaRegCopy className="text-2xl mx-auto" /> },
  { id: "8", label: "Logs", icon: <FaRegCopy className="text-2xl mx-auto" /> },
  { id: "9", label: "About", icon: <FaRegCopy className="text-2xl mx-auto" /> },
];
